#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.template_file.cb_app: Reading...
tls_private_key.bastion: Refreshing state... [id=161a6b5e631c819356fdc2c450325e1b82ac853c]
data.template_file.cb_app: Read complete after 0s [id=20ec471f6ed508e1a9949f87acae01e2d35f79952e4a0a39aedf8687ad99f5a6]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
aws_key_pair.bastion_key_pair: Refreshing state... [id=bastion-key-test]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
data.aws_secretsmanager_secret.github_token: Reading...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster]
aws_ssm_parameter.bastion_key_pair: Refreshing state... [id=/test/bastion/ssh-key]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
data.aws_availability_zones.available: Reading...
aws_iam_role.ecs_task_role: Refreshing state... [id=role-name-task]
aws_codedeploy_app.application: Refreshing state... [id=e24dfba9-e70f-462d-82c3-31e4d10e40b5:application]
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=role-name]
data.aws_secretsmanager_secret.github_token: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=role-name-task-20240816090311029800000002]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=role-name-20240816090311060400000003]
aws_ecs_task_definition.app: Refreshing state... [id=cb-app-task]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole-20240816090310994000000001]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_lb_target_group.green_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/green-target-group/34044db384c4fb1c]
aws_lb_target_group.blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/1fb9b53178f17faf]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-01c3cdcddfa347799]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/main/ea7fde6e48daa652]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/main/ea7fde6e48daa652/d281553479d56640]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/cb-cluster/cb-service]
aws_codedeploy_deployment_group.deployment_group: Refreshing state... [id=c274e553-8b57-43b7-b18a-5390a24c4034]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/cb-app-task:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/cb-app-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  - essential        = true
                  - mountPoints      = []
                    name             = "cb-app"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ]
        )
      ~ execution_role_arn       = "arn:aws:iam::802288441694:role/role-name" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "cb-app-task" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_iam_role.ecs_task_execution_role must be replaced
-/+ resource "aws_iam_role" "ecs_task_execution_role" {
      ~ arn                   = "arn:aws:iam::802288441694:role/role-name" -> (known after apply)
      ~ create_date           = "2024-08-16T09:03:10Z" -> (known after apply)
      ~ id                    = "role-name" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> (known after apply)
      ~ name                  = "role-name" -> "ecs-execution-role" # forces replacement
      + name_prefix           = (known after apply)
      ~ role_last_used        = [
          - {
              - last_used_date = "2024-08-16T09:56:50Z"
              - region         = "eu-west-1"
            },
        ] -> (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA3VTA6DFPG2HINCNAP" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.ecs_task_role must be replaced
-/+ resource "aws_iam_role" "ecs_task_role" {
      ~ arn                   = "arn:aws:iam::802288441694:role/role-name-task" -> (known after apply)
      ~ create_date           = "2024-08-16T09:03:10Z" -> (known after apply)
      ~ id                    = "role-name-task" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonS3FullAccess",
        ] -> (known after apply)
      ~ name                  = "role-name-task" -> "ecs-task-role" # forces replacement
      + name_prefix           = (known after apply)
      ~ role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA3VTA6DFPEZSIL6VKW" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment" {
      ~ id         = "role-name-20240816090311060400000003" -> (known after apply)
      ~ role       = "role-name" -> "ecs-execution-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.task_s3 must be replaced
-/+ resource "aws_iam_role_policy_attachment" "task_s3" {
      ~ id         = "role-name-task-20240816090311029800000002" -> (known after apply)
      ~ role       = "role-name-task" -> "ecs-task-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*